# Pandas Understanding GroupBy and other tasks

In [2]:
import numpy as np
import pandas as pd

In [21]:
list1 = [[1,2,3,4],[1,2,7,3],[1,2,4,3]]

In [25]:
df = pd.DataFrame(list1, columns = ['A','B','C','D'])

In [26]:
df

   A  B  C  D
0  1  2  3  4
1  1  2  7  3
2  1  2  4  3

In [24]:
# Groupby
df.groupby(by=['A']).sum()

   B   C   D
A
1  6  14  10

In [38]:
list1 = [[1,2,3,4],[3,5,7,3],[1,6,4,3]]

In [39]:
df = pd.DataFrame(list1, columns = ['A','B','C','D'])
df

   A  B  C  D
0  1  2  3  4
1  3  5  7  3
2  1  6  4  3

In [40]:
df1 = df.groupby(by=['B']).sum()

In [41]:
df1

   A  C  D
B
2  1  3  4
5  3  7  3
6  1  4  3

In [48]:
list1 = [[1,2,3,4],[3,5,np.nan,3],[1,2,4,np.nan]]

In [49]:
df4 = pd.DataFrame(list1, columns =['A','B','C','D'])

In [50]:
df4

   A  B    C    D
0  1  2  3.0  4.0
1  3  5  NaN  3.0
2  1  2  4.0  NaN

In [55]:
df4.groupby(by ='C',dropna = False).sum()

     A  B    D
C
3.0  1  2  4.0
4.0  1  2  0.0
NaN  3  5  3.0

In [56]:
df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

In [60]:
df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [59]:
df.groupby(by = "class").sum()

        max_speed
class
bird        413.0
mammal      138.2

In [67]:
grouped = df.groupby("order", axis="columns")
grouped

In [66]:
grouped = df.groupby("order").sum()
grouped

                max_speed
order
Carnivora           138.2
Falconiformes       389.0
Primates              0.0
Psittaciformes       24.0

In [69]:
df.groupby(['class','order']).sum()

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora           138.2
       Primates              0.0

In [70]:
import seaborn as sns

In [71]:
tips = sns.load_dataset('tips')

In [72]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [74]:
tips.groupby(['sex','smoker']).sum()

               total_bill     tip  size
sex    smoker
Male   Yes        1337.07  183.07   150
       No         1919.75  302.00   263
Female Yes         593.27   96.74    74
       No          977.68  149.77   140